#pragma once
/*///////////////////////////////////////////////////////////////////////////////////////////////////
*【ウィンドウ関連メイン機能】																		*
*	作成日：2018/5/1																				*
*	更新日：2019/1/26																				*
*	バージョン：1.0.0																				*
///////////////////////////////////////////////////////////////////////////////////////////////////*/

#include "DxLib.h"

//▽定数群▽=========================================================================================

#define WINDOW_SIZE_X	(816)	//ウィンドウ横サイズ[px]
#define WINDOW_SIZE_Y	(624)	//ウィンドウ縦サイズ[px]

#define ALL		(0x08)	// All
#define FLIP	(0x0E)	// Flip
#define MESSAGE (0x0D)	// Message
#define CLEAR	(0x0B)	// Clear

#define WINDOW_COLOR (gray17) //ウィンドウ背景色をgray17とする

//△定数群△=========================================================================================


//▽関数群▽=========================================================================================

//初期化
#define Init Winit(  );

//main関数
#define main(  ) WINAPI WinMain( HINSTANCE, HINSTANCE, LPSTR, int )

//ループマネージ
#define Loop( flag ) Wupdate( flag )

//△関数群△=========================================================================================
