#pragma once
/*///////////////////////////////////////////////////////////////////////////////////////////////////
*【ウィンドウ標準】																					*
*	作成日：2019/1/26																				*
*	更新日：2019/1/26																				*
*	バージョン：1.0.0																				*
///////////////////////////////////////////////////////////////////////////////////////////////////*/
#include "../lib/common.h"

//ウィンドウ初期化関数（DXライブラリ依存）
int Winit();

//ウィンドウ更新処理（DXライブラリ依存）
int Wupdate(unsigned char update_flag);

//プロセス終了
void End();